#ifndef __TOTAL_H
#define __TOTAL_H
/******************м╥нд╪Ч╟Э╨╛*************/
#include "includes.h"
#include "malloc.h"
/*****************╦ВхннЯм╥нд╪Ч************/
#include "lcdshow.h"
#include "uart.h"
#include "gprs.h"
#include "dataget.h"
/****************тЬгЛ╨Й************************/
#include "sdcard.h"
/******************хннЯ©И╤╗рЕ*************/

//хннЯпР╨е:1
//хннЯ╧╕дэ╫Ииэ:LED╤╗й╠иак╦ё╛отй╬о╣мЁн╢кю╩З
//хннЯсеох╪╤:60
//хннЯ╥╒кмоШо╒:нч
//хннЯ╫сйэоШо╒ё╨нч
//хннЯюЮпм(й╠╪ДвХхШпм/оШо╒вХхШпм):й╠╪ДвХхШ

//хннЯсеох╪╤
#define LED_TASK_PRIO		60
//хннЯ╤яу╩╢Сп║	
#define LED_STK_SIZE 		512
//хннЯ©ьжф©И
extern OS_TCB LEDTastTCB;
//хннЯ╤яу╩	
extern CPU_STK LED_TASK_STK[LED_STK_SIZE];

//хннЯпР╨е:2
//хннЯ╧╕дэ╫Ииэ:LCDотй╬дё©И
//хннЯсеох╪╤:59
//хннЯ╥╒кмоШо╒:нч
//хннЯ╫сйэоШо╒ё╨╫сйэLCDотй╬оШо╒
//хннЯюЮпм(й╠╪ДвХхШпм/оШо╒вХхШпм):оШо╒вХхШё╗хннЯвт╢ЬоШо╒╤сапё╘

//хннЯсеох╪╤
#define LCD_TASK_PRIO		59
//хннЯ╤яу╩╢Сп║	
#define LCD_STK_SIZE 		512
//хннЯ©ьжф©И
extern OS_TCB LCDTastTCB;
//хннЯ╤яу╩	
extern CPU_STK LCD_TASK_STK[LCD_STK_SIZE];

//хннЯпР╨е:3
//хннЯ╧╕дэ╫Ииэ:╢╝©зйЩ╬щ╢╕юМдё©И
//хннЯсеох╪╤:58
//хннЯ╥╒кмоШо╒:нч
//хннЯ╫сйэоШо╒ё╨╢╝©зжп╤о╥╒ю╢╣дcharвж╥Ш
//хннЯюЮпм(й╠╪ДвХхШпм/оШо╒вХхШпм):оШо╒вХхШё╗хннЯвт╢ЬоШо╒╤сапё╘

//хннЯсеох╪╤
#define UART_TASK_PRIO		58
//хннЯ╤яу╩╢Сп║	
#define UART_STK_SIZE 		512
//хннЯ©ьжф©И
extern OS_TCB UARTTastTCB;
//хннЯ╤яу╩	
extern CPU_STK UART_TASK_STK[UART_STK_SIZE];

//хннЯпР╨е:4
//хннЯ╧╕дэ╫Ииэ:GPRSдё©И╢╝©з╫сйу╢╕юМ
//хннЯсеох╪╤:47
//хннЯ╥╒кмоШо╒:уШюМ╨ц╣д╩ь╦╢ё╛оЮ╣╠сзrfile.getline()
//хннЯ╫сйэоШо╒ё╨╢╝©з3жп╤о╥╒ю╢╣дcharвж╥Ш
//хннЯюЮпм(й╠╪ДвХхШпм/оШо╒вХхШпм):оШо╒вХхШё╗хннЯвт╢ЬоШо╒╤сапё╘

//хннЯсеох╪╤
#define GPRS_TASK_PRIO		47
//хннЯ╤яу╩╢Сп║	
#define GPRS_STK_SIZE 		1024
//хннЯ©ьжф©И
extern OS_TCB GPRSTastTCB;
//хннЯ╤яу╩	
extern CPU_STK GPRS_TASK_STK[GPRS_STK_SIZE];

//хннЯпР╨е:5
//хннЯ╧╕дэ╫Ииэ:GPRSдё©ИаВЁл╧эюМ
//хннЯсеох╪╤:50
//хннЯ╥╒кмоШо╒:╥╒мЫgprsйЩ╬щ╥╒кмдё©И
//хннЯ╫сйэоШо╒ё╨хннЯ4╥╒ю╢╣дуШюМ╨ц╣д╣╔пппео╒
//хннЯюЮпм(й╠╪ДвХхШпм/оШо╒вХхШпм):й╠╪Д/оШо╒╩Л╨овХхШ

//хннЯсеох╪╤
#define GPRSRUN_TASK_PRIO		49
//хннЯ╤яу╩╢Сп║	
#define GPRSRUN_STK_SIZE 		2048
//хннЯ©ьжф©И
extern OS_TCB GPRSRUNTastTCB;
//хннЯ╤яу╩	
extern CPU_STK GPRSRUN_TASK_STK[GPRSRUN_STK_SIZE];

//хннЯпР╨е:6
//хннЯ╧╕дэ╫Ииэ:GPRSдё©ИйЩ╬щ╥╒км
//хннЯсеох╪╤:48
//хннЯ╥╒кмоШо╒:╢╝©з╥╒км╦Ьgprsдё©И║ё
//хннЯ╫сйэоШо╒ё╨м╗╧ЩЁУй╪╩╞╫сйу╡╩м╛╣д╥╒кмвж╥Ш╢╝
//хннЯюЮпм(й╠╪ДвХхШпм/оШо╒вХхШпм):й╠╪ДвХхШ

//хннЯсеох╪╤
#define GPRSSEND_TASK_PRIO		48
//хннЯ╤яу╩╢Сп║	
#define GPRSSEND_STK_SIZE 		1024
//хннЯ©ьжф©И
extern OS_TCB GPRSSENDTastTCB;
//хннЯ╤яу╩	
extern CPU_STK GPRSSEND_TASK_STK[GPRSSEND_STK_SIZE];


/****************тЬгЛ╨Й************************/


/**********SD©╗ЁУй╪╩╞хннЯ*****************/
//хннЯпР╨е:7
//хннЯ╧╕дэ╫Ииэ:SD©╗
//хннЯсеох╪╤:50
//хннЯ╥╒кмоШо╒:╢╝©з╥╒км╦Ьgprsдё©И║ё
//хннЯ╫сйэоШо╒ё╨м╗╧ЩЁУй╪╩╞╫сйу╡╩м╛╣д╥╒кмвж╥Ш╢╝
//хннЯюЮпм(й╠╪ДвХхШпм/оШо╒вХхШпм):й╠╪ДвХхШ

//хннЯсеох╪╤
#define SDCARD_TASK_PRIO  40
//хннЯ╤яу╩╢Сп║
#define  SDCARD_STK_SIZE  4096
//хннЯ©ьжф©И
extern OS_TCB   SDcardTask_TCB;
//хннЯ╤яу╩
extern CPU_STK  SDCARD_TASK_STK[SDCARD_STK_SIZE];
//оШо╒╤сап╣дЁ╓╤х
#define SDCARD_TASK_Q_NUM  4
//extern OS_Q DATAPACK_Msg;   //╤╗рЕр╩╦ЖоШо╒╤сапё╛сцсз╟╢╪ЭоШо╒╢╚╣щё╛дёдБоШо╒сйо


/************************ц╚ЖнеТ****************************/
//хннЯпР╨е:8
//хннЯ╧╕дэ╫Ииэ:GPRSдё©ИйЩ╬щ╥╒км
//хннЯсеох╪╤:51
//хннЯ╥╒кмоШо╒:╢╝©з╥╒км╦Ьgprsдё©И║ё
//хннЯ╫сйэоШо╒ё╨м╗╧ЩЁУй╪╩╞╫сйу╡╩м╛╣д╥╒кмвж╥Ш╢╝
//хннЯюЮпм(й╠╪ДвХхШпм/оШо╒вХхШпм):й╠╪ДвХхШ

//хннЯсеох╪╤
#define BDGPS_TASK_PRIO		51
//хннЯ╤яу╩╢Сп║	
#define BDGPS_STK_SIZE 		512*4
//хннЯ©ьжф©И
extern OS_TCB BDGPSTastTCB;
//хннЯ╤яу╩	
extern CPU_STK BDGPS_TASK_STK[BDGPS_STK_SIZE];

/**************************йЩ╬щ╡и╪╞************************/
//хннЯпР╨е:9
//хннЯ╧╕дэ╫Ииэ:ATT7022EйЩ╬щ╡и╪╞
//хннЯсеох╪╤:10
//хннЯ╥╒кмоШо╒:╥╒кмйЩ╬щ╦ЬGPRSдё©ИсКSDcardдё©И
//хннЯ╫сйэоШо╒ё╨╡╩╫сйэоШо╒║ём╗╧ЩRTC╤ах║й╠╪Д
//хннЯюЮпм(й╠╪ДвХхШпм/оШо╒вХхШпм):й╠╪ДвХхШ
//хннЯсеох╪╤
#define DATAGET_TASK_PRIO		10
//хннЯ╤яу╩╢Сп║	
#define DATAGET_STK_SIZE 		4096*2
//хннЯ©ьжф©И
extern OS_TCB DATAGETTastTCB;
//хннЯ╤яу╩	
extern CPU_STK DATAGET_TASK_STK[DATAGET_STK_SIZE];

/******************оШо╒а©╤╗рЕ*************/
extern OS_SEM SDcardWrite;
#endif
